Repository: Eric-Brison/dynacase-tengine-client
Catalog: locale/*/TENGINE_CLIENT_*.po
Languages: fr

source: Activate Transformation Engine
fr: Activation du serveur de transformation

source: Activate file indexing with TE
fr: Activation de l'indexation plein texte avec TE

source: Error reading content from server
fr: Erreur de lecture depuis le serveur

source: Error sending command to TE server
fr: Erreur d'envoi de la commande au serveur TE

source: Error sending file
fr: Erreur lors de l'envoi du fichier

source: Handshake error
fr: Erreur de négociation de la connection

source: Invalid response size '%s'
fr: Taille de réponse invalide '%s'

source: Malformed JSON argument: %s
fr: Argument JSON malformé: %s

# TransformationEngine
source: Please set all TE parameters
fr: Vous devez configurer l'accès au serveur de transformation en valorisant les paramètres

source: Returned data is not of array type (%s)
fr: La donné retournée n'est pas de type array (%s)

source: TE:Client:(filtered from _MAX_ total records)
fr: (sur un total de _MAX_)

source: TE:Client:Abort
fr: Annuler la tâche

source: TE:Client:Client count
fr: Nombre de clients

source: TE:Client:Datas
fr: Données serveur

source: TE:Client:Date
fr: Date

source: TE:Client:Display _MENU_ tasks per page
fr: _MENU_ tâches par page

source: TE:Client:Document
fr: Document

source: TE:Client:Engine
fr: Moteur

source: TE:Client:Error task count
fr: Nomnbre de tâches terminées en erreur

source: TE:Client:Filename
fr: Fichier

source: TE:Client:Interrupted task count
fr: Nombre de tâches interrompues

source: TE:Client:Log
fr: Journal serveur

source: TE:Client:Nothing found - sorry
fr: Aucune tâche trouvée.

source: TE:Client:Owner
fr: Propriétaire

source: TE:Client:Processing task count
fr: Nombre de tâche en cours de traitement

source: TE:Client:Server system load
fr: Charge moyenne système

source: TE:Client:Showing 0 to 0 of 0 records
fr: Aucune tâche à afficher

source: TE:Client:Showing _START_ to _END_ of _TOTAL_ records
fr: Tâches _START_ à _END_ sur _TOTAL_

source: TE:Client:Status
fr: Statut

source: TE:Client:Stop counters update
fr: Arrêt de la mise à jour des indicateurs

source: TE:Client:Success task count
fr: Nombre de tâches terminées avec succès

source: TE:Client:Task Id
fr: Id tâche

source: TE:Client:Transferring task count
fr: Nombre de tâches en cours de transfert

source: TE:Client:Waiting task count
fr: Nombre de tâches en attente de traitement

source: TE:Client:not fully supported server version, need server version
fr: La version de votre serveur ne supporte pas complètement les fonctions de cette interface. La version nécessaire est la

source: TE:Client:reset filters
fr: Mise à jour

source: TE:Client:reset filters and reload tasks
fr: Vide les recherches et met à jour la liste des tâches

source: TE:Client:sFirst
fr: Première

source: TE:Client:sLast
fr: Dernière

source: TE:Client:sLoadingRecords
fr: Chargement de la liste des tâches

source: TE:Client:sNext
fr: Suivante

source: TE:Client:sPrevious
fr: Précédente

source: TE:Client:sProcessing
fr: En cours de traitement...

source: TE:Client:sSearch
fr: Rechercher

source: TE:Client:sZeroRecords
fr: Aucune tâche

source: TE:Client:search date
fr: rechercher par date

source: TE:Client:search document
fr: rechercher par document (titre ou ID)

source: TE:Client:search engines
fr: rechercher par moteur

source: TE:Client:search filename
fr: rechercher par nom de fichier

source: TE:Client:search owner
fr: rechercher par propriétaire

source: TE:Client:search status:
fr: rechercher par status

source: TE:Client:search task id
fr: rechercher par identicateur de tâche

source: TE:Client:stop task processing and clean working datas
fr: Annule le traitement de la tâche et nettoie les données de travail

source: TE:Client:unsupported server version
fr: Version serveur non supportée.

source: TE:Status:All
fr: Tous

source: TE:Status:Begin
fr: Démarrage

source: TE:Status:Error
fr: Erreur

source: TE:Status:Interrupted
fr: Interrompu

source: TE:Status:Processing
fr: En cours

source: TE:Status:Recovered
fr: Récupéré

source: TE:Status:Success
fr: Succès

source: TE:Status:Transferring
fr: Transfert

source: TE:Status:Unknown [%s]
fr: Inconnu (%s)

source: TE:Status:Waiting
fr: En attente

source: Transformation Engine callback url
fr: URL pour les callback du serveur de transformation

source: Transformation Engine server host name
fr: Adresse du serveur de transformation

source: Transformation Engine server port number
fr: Numéro de port du serveur de transformation

source: Transformation Engine timeout connection (in seconds)
fr: Temps d'attente de connexion pour le moteur de transformation (en secondes)

source: Unexpected handshake message: %s
fr: Message de négociation de connection inattendu : %s

source: abort command execution fails
fr: L'exécution de la comment d'arrêt de la tâche a échouée.

source: empty file
fr: fichier vide

source: socket creation error
fr: Erreur lors de la création d'une socket

source: task aborting fails
fr: L'arrêt de la tâche est en échec.

source: task successfully aborted
fr: La tâche a été interrompue.

source: te:modified
fr: Modifié

source: tengine_client:acl:tengine_client
fr: Transformation Engine administration ACL

source: tengine_client:action:admin_actions_list:short_name
fr: ADMIN_ACTIONS_LIST

source: tengine_client:action:supported mimes
fr: liste des types mimes supportés par ce moteur

source: tengine_client:action:tengine_client_convert
fr: Transformation d'un fichier

source: tengine_client:action:tengine_client_convert:Convert
fr: Traitement unitaire de la conversion d'un fichier

source: tengine_client:action:tengine_client_convert:Download result
fr: Télécharger le résultat

source: tengine_client:action:tengine_client_convert:Error creating temporary file.
fr: Erreur de création de fichier temporaire.

source: tengine_client:action:tengine_client_convert:Error fetching task info with id '%s': %s
fr: Erreur de récupération des informations de la tâche '%s' : %s

source: tengine_client:action:tengine_client_convert:Error in file upload: %s
fr: Erreur d'envoi du fichier : %s

source: tengine_client:action:tengine_client_convert:Error moving uploaded file to '%s'.
fr: Erreur de déplacement du fichier envoyé dans '%s'.

source: tengine_client:action:tengine_client_convert:File is empty.
fr: Le fichier est vide.

source: tengine_client:action:tengine_client_convert:Missing file.
fr: Fichier manquant.

source: tengine_client:action:tengine_client_convert:Task '%s' is not finished.
fr: La tâche '%s' n'est pas terminée.

source: tengine_client:action:tengine_client_convert:Unknown op '%s'.
fr: Opération inconnue '%s'.

source: tengine_client:action:tengine_client_convert:conversion avancement
fr: Avancement de la conversion

source: tengine_client:action:tengine_client_convert:uploaded file
fr: Fichier à traiter

source: tengine_client:action:tengine_client_convert:with engine
fr: Moteur de transformation

source: tengine_client:action:tengine_client_param:Check server connexion
fr: Contrôler la connexion au serveur

source: tengine_client:action:tengine_client_param:max client
fr: Nombre maximum de clients simultanés

source: tengine_client:action:tengine_client_param:server version
fr: Version du serveur de transformation

source: tengine_client:action:tengine_client_params
fr: Configuration

source: tengine_client:action:tengine_client_selftests
fr: Éxécution des tests serveur

source: tengine_client:action:tengine_client_tasks
fr: Surveillance

source: tengine_client:action:tengine_client_tasks:Unknown op '%s'.
fr: Opération inconnue '%s'.

source: tengine_client:description
fr: Gestion et surveillance du serveur de transformation

source: tengine_client:see supported mimes
fr: Types mimes supportés

source: tengine_client:short_name
fr: Serveur de transformation

source: tengine_client_selftests:all engines
fr: sélection de tous les moteurs de transformation

source: tengine_client_selftests:please select engine to test
fr: merci de sélectionner le moteur à tester

source: tengine_client_selftests:run server selected test
fr: Lancer le test…

source: tengine_client_selftests:server communication error
fr: Erreur de communication avec le serveur

source: tengine_client_selftests:server engines tests
fr: Test des moteurs installés sur le serveur

source: tengine_client_tasks:task logbook
fr: Surveillance du serveur
